/**
 * Змінні та типи даних
 *
 * - Оголошення змінних з let и const
 * - Перевизначення значення
 * - Найменування змінних
 * - Вибір між const і let
 * - Числа, рядки, булі, null, undefined
 * - Оператор typeof
 */

//let - оператор для оголошення змінної(не може бути дві змінних з однаковою назвою)

let userAge = 30; // ініціалізація змінної (я створив змінну з назвою userAge і присвоїв(або ініціалізував) значення 30)

console.log(userAge);

userAge = 35; // перевизначення значення, це коли ви хочете змініти значення вже існуючій змінній

console.log(userAge);

//! ====================================

// const userName; //! ТАК НЕ МОЖНА, ТОМУ ЩО КОНСТАНТИ ПОВИННІ БУТИ ІНІЦІАЛІЗОВАНІ ВІДРАЗУ
const userName = "Gleb";
console.log(userName);
// userName = "Oleg"; //! ТАК РОБИТИ НЕ МОЖНА, ТОМУ ЩО ЦЕ КОНСТАНТА. ВОНА ОТРИМУЄ ЗНАЧЕННЯ ТІЛЬКИ ПІД ЧАС СТВОРЕННЯ, ПОТІМ ПЕРЕВИЗНАЧИТИ ЦЕ ЗНАЧЕННЯ НЕМОЖЛИВО І ВИ ОТРИМАЄТЕ ПОМИЛКУ

//! ====================================

/*
 * Number: будь-які числа(відʼємні, додатні, дробові): 6,            4939494, -7777, 5.4893934
 * String: будь-що, що ви запишете всередині лапок(лапики 3 видів: 1. '' 2. "" 3. ``) "hello world", "5", "true"
 * Boolean: логічний тип, вміє зберігати тільки 2 значення: правда (true) і неправда (false)
 * undefined: присутність відсутності (коли щось не знайдено або невизначено)
 * null: відсутність присутності - нічого (частіше за все ви його отримаєте тоді, коли будете посилатись на неіснуючий елемент, або коли просто не буде посилання на тей елемент)
 */

//! ====================================

// typeof - це оператор який допомагає нам зрозуміти тип данних якогось значення (повертає рядок з назвою типу)

const age = "40";

console.log(typeof age)
console.log(typeof true)
console.log(typeof 0)
console.log(typeof null) // object
console.log(typeof undefined) 

