/**
 * Типові помилки
 *
 * - Звернення до змінної до її оголошення
 * - Перевизначення значення для змінної оголошеної через const
 * - Звертання по неправильному імені індетифікатора
 *
 */

// console.log(username) //! не можна, звертатись до констант або змінних треба тільки після оголошення
const username = "Mango";
// username = "Oleg"; //! ТАК РОБИТИ НЕ МОЖНА, ТОМУ ЩО ЦЕ КОНСТАНТА. ВОНА ОТРИМУЄ ЗНАЧЕННЯ ТІЛЬКИ ПІД ЧАС СТВОРЕННЯ, ПОТІМ ПЕРЕВИЗНАЧИТИ ЦЕ ЗНАЧЕННЯ НЕМОЖЛИВО І ВИ ОТРИМАЄТЕ ПОМИЛКУ

let age = 20;

// console.log(agge); //! звертання до неіснуючого індетифікатора (наприклад, змінної) - ви отримуєте помилку тому що такої змінної не існує в коді

