/**
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */
//! ================================

// примітиви порівнюються за значенням(тобто в прикладі нижче порівняється цифра 5 з цифрою 5)
// const a = 5;
// const b = 5;
// console.log(a === b);
//! ================================

// масиви порівнюються за посиланням в памʼяті, а не за значенням, як примітиви

// const a = [1, 2, 3]; // [] - це синтаксис створення нового масиву, при створенні для цього масиву береться окрема комірка памʼяті, а у змінну або константу, куди ви зберігаєте масив збергіється посилання на цю комірку (зберігається посилання на те, де знаходиться цей масив у памʼяті(адреса))
// const b = [1, 2, 3]; // орієнтуючись на вищенаписане, це абсолютно новий масив з іншим посиланням на комірку, не дивлячись на те, що значення цих масивів(1, 2, 3) абсолютно однакові. Нам це не важливо, бо ми їх не порівнюємо.

// console.log(a == b); // false - бо у цих констант різні посилання на різні комірки де лежать різні масиви
// console.log(a === b); // false

//! ================================

// const a = [1, 2, 3];
// const b = a; // ТАК РОБИТИ НЕ МОЖНА(ну, точніше можна, але не рекомендую). Тут ви зберегли в константу b посилання на масив a. Це значить що у константі a та b зберігається одне й те ж саме посилання на один й той самий масив.

// b[1] = 100; // тут зміняться обидва масиви, так як це один й той самий масив

// console.table(a);
// console.table(b);

// console.log(typeof a); // object
// console.log(Array.isArray(a)); // true (можна використовувати цю функцію для перевірки чи є значення масивом)

// console.log(a == b); // true
// console.log(a === b); // true

//! ================================

// const a = [1, 2, 3];
// // якщо вам все ж таки треба зробити копію масиву, можна використати декілька способів, наприклад: Array.from(), [...](spread), slice()
// // const b = Array.from(a);
// const b = a.slice();

// b[1] = 100; // тут зміняться обидва масиви, так як це один й той самий масив

// console.table(a);
// console.table(b);

// console.log(a == b); // false
// console.log(a === b); // false

//! ================================
