/**
 * Ітерація по масиву
 *
 * - Ітерація по масиву циклом for
 * - Метод includes
 * - Цикл for...of
 * - Різниця у використанні for и for...of
 */

// const friends = ["Mango", "Kiwi", "Poly", "Ajax"];
// console.table(friends);

// for (let i = 0; i < friends.length; i += 1) {
//   friends[i] += `-${i}`;
// }

// console.table(friends);

//* for of - перебирає значення елементів масиву, тобто в змінну збергіється відразу значення елементу
// *for of на відміну від звичайного фору не є пластичним. Він залізно перебирає увесь масив від самого початку і до самого кінця. Змінити це не можна.

// for (const friend of friends) {
//   console.log(friend);
// }

//* for...in - перебирає індекси масиву, аналогічно звичаному фор. Але на відміну від звичайного фору не є пластичним. Він залізно перебирає увесь масив від самого початку і до самого кінця. Змінити це не можна.

// for (const i in friends) {
//   //! ВАЖЛИВО!!! i - це завжди рядок, тому, якщо ви плануєте робити розрахунки з індексом, використовуйте явне зведення типів.

//   console.log(friends[i]);
// }

/**
 * Напиши скрипт для обчислення площі прямокутника зі сторонами,
 * значення яких зберігаються у змінній values у вигляді рядка.
 * Значення гарантовано розділені пробілом.
 */

// const values = "150 3";

// const arrValues = values.split(" ");

// console.log(arrValues);
// const height = Number(arrValues[0]);
// const width = Number(arrValues[1]);
// const S = height * width;
// console.log(`S = ${height} * ${width} = ${S}`)

/**
 * Напиши скрипт для перебору масиву fruits.
 * Для кожного елемента масиву виведи в консоль рядок
 * у форматі номер_елемента: значення_елемента.
 * Нумерація елементів повинна починатися з 1.
 */

const fruits = ["🍎", "🍇", "🍑", "🍌", "🍋"];

/*
1: 🍎
2: 🍇
3: 🍑
...
*/

// let msg = ""

// for(let i = 0; i < fruits.length; i += 1){
//   msg += `${i + 1}: ${fruits[i]}\n`
// }

// for(const i in fruits){
//   msg += `${Number(i) + 1}: ${fruits[i]}\n`
// }

// console.log(msg)
